nightt5879/2023guangshe_xiao/STM32/test/Hardware/PWM.c
#include "stm32f10x.h"                  // Device header
#include "PWM.h"

void PWM_Init(void)
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
TIM_TimeBaseStructure.TIM_Period = 0xFFFF;  // ???????????
TIM_TimeBaseStructure.TIM_Prescaler = 0;  // ???????0
TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;  // ?????????1
TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  // ???????????
TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure);

// ??TIM1???????(ETR)??
TIM_ETRClockMode2Config(TIM1, TIM_ExtTRGPSC_OFF, TIM_ExtTRGPolarity_NonInverted, 0);
	    // TIM1??????
    TIM_ITConfig(TIM1, TIM_IT_Update, ENABLE);

    // NVIC ???????
    NVIC_InitTypeDef NVIC_InitStructure;
//    NVIC_InitStructure.NVIC_IRQChannel = TIM1_UP_IRQn;
//    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; //?????
//    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;        //?????
//    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;           //??IRQ??
//    NVIC_Init(&NVIC_InitStructure);

// ??TIM1
TIM_Cmd(TIM1, ENABLE);

// ??? TIM3
//TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
//NVIC_InitTypeDef NVIC_InitStructure;

// ?? TIM3 ??
RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

// ?? TIM3 ????
TIM_TimeBaseStructure.TIM_Period = 999;  // ??????
TIM_TimeBaseStructure.TIM_Prescaler = 7199;  // ????,????????72000000/(7199+1) = 10kHz
TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;  // ??????
TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  // ??????
TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);

// ?? NVIC
NVIC_InitStructure.NVIC_IRQChannel = TIM6_IRQn;  // TIM3 ??
NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;  // ?????
NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;  // ????
NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;  // ????
NVIC_Init(&NVIC_InitStructure);

// ?? TIM3 ????
TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);

// ?? TIM3
TIM_Cmd(TIM3, ENABLE);

	
//	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
//	GPIO_PinRemapConfig(GPIO_PartialRemap1_TIM2, ENABLE);
//	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	
	//Init All The PWM IO
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;// | GPIO_Pin_2 | GPIO_Pin_3;		//GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	TIM_InternalClockConfig(TIM2);
	
	//All Timer is the same 
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 1000 - 1;//20000 - 1;		//ARR
	TIM_TimeBaseInitStructure.TIM_Prescaler = 2 - 1;		//PSC
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);
	
	//All The Servo is the Same Mod
	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCStructInit(&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 100;		//CCR
	
	//The 4 Servoes Init
	TIM_OC1Init(TIM2, &TIM_OCInitStructure);
	TIM_OC2Init(TIM2, &TIM_OCInitStructure);
	// TIM_OC3Init(TIM2, &TIM_OCInitStructure);
	// TIM_OC4Init(TIM2, &TIM_OCInitStructure);
	
	TIM_Cmd(TIM2, ENABLE);
}

void PWM_SetCompare1(uint16_t Compare)
{
	TIM_SetCompare1(TIM2, Compare);
}

void PWM_SetCompare2(uint16_t Compare)
{
	TIM_SetCompare2(TIM2, Compare);
}

void PWM_SetCompare3(uint16_t Compare)
{
	TIM_SetCompare3(TIM2, Compare);
}

void PWM_SetCompare4(uint16_t Compare)
{
	TIM_SetCompare4(TIM2, Compare);
}

void PWM_SetCompara(uint8_t CHx, uint16_t Compare)
{
    switch (CHx){
        case 1:TIM_SetCompare1(TIM2, Compare);break;
        case 2:TIM_SetCompare2(TIM2, Compare);break;
        case 3:TIM_SetCompare3(TIM2, Compare);break;
        case 4:TIM_SetCompare4(TIM2, Compare);break;
        default:break;
    }
}

void PWM_Test(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
	TIM_OCInitTypeDef  TIM_OCInitStructure;
 
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1, ENABLE);
 	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA , ENABLE);  
	                                                                     	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;  
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	TIM_TimeBaseStructure.TIM_Period = 72 - 1; 
	TIM_TimeBaseStructure.TIM_Prescaler =20000 - 1; 
	TIM_TimeBaseStructure.TIM_ClockDivision = 0; 
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  
	TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStructure); 

	//???????????,??????PWM?!!!!
	TIM_OCInitStructure.TIM_Pulse = 500; 		//??????????????
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;  //TIM1????????1
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;//????????
	TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Enable;//??????N??
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;//TIM1 ???????
	TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High;//TIM1 ????N???
	TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Reset;//? MOE=0 ?? TIM1 ????????
	TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCNIdleState_Reset;//? MOE=0 ?? TIM1 ???? N ????
	TIM_OC1Init(TIM1, &TIM_OCInitStructure); //??????1???  
 
	TIM_OC1PreloadConfig(TIM1, TIM_OCPreload_Enable);//??TIMx? CCR1 ???? 
	TIM_ARRPreloadConfig(TIM1, ENABLE);//????????
	
	TIM_CtrlPWMOutputs(TIM1,ENABLE);
	TIM_Cmd(TIM1, ENABLE);  //?????	
}

void PWM_SetTest(uint8_t CHx, uint16_t Compare)
{
    switch (CHx){
        case 1:TIM_SetCompare1(TIM1, Compare);break;
        case 2:TIM_SetCompare2(TIM1, Compare);break;
        case 3:TIM_SetCompare3(TIM1, Compare);break;
        case 4:TIM_SetCompare4(TIM1, Compare);break;
        default:break;
    }
}

void PWM_Test3(void)
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
//	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
//	GPIO_PinRemapConfig(GPIO_PartialRemap1_TIM2, ENABLE);
//	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	
	//Init All The PWM IO
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0| GPIO_Pin_1;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	TIM_InternalClockConfig(TIM3);
	
	//All Timer is the same 
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period = 20000 - 1;		//ARR
	TIM_TimeBaseInitStructure.TIM_Prescaler = 72 - 1;		//PSC
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseInitStructure);
	
	//All The Servo is the Same Mod
	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCStructInit(&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = 500;		//CCR
	
	//The 4 Servoes Init
	TIM_OC1Init(TIM3, &TIM_OCInitStructure);
	TIM_OC2Init(TIM3, &TIM_OCInitStructure);
	TIM_OC3Init(TIM3, &TIM_OCInitStructure);
	TIM_OC4Init(TIM3, &TIM_OCInitStructure);
	
	//TIM_ARRPreloadConfig(TIM3, ENABLE);//????????
	
	TIM_Cmd(TIM3, ENABLE);
}
